/*
MySQL Data Transfer
Source Host: 123.56.112.254
Source Database: awe_pms
Target Host: 123.56.112.254
Target Database: awe_pms
Date: 2015/1/28 14:52:44
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for product_dict
-- ----------------------------
DROP TABLE IF EXISTS `product_dict`;
CREATE TABLE `product_dict` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键标识',
  `type` tinyint(4) DEFAULT NULL COMMENT '类型',
  `attr` varchar(32) DEFAULT NULL COMMENT '属性',
  `value` varchar(128) DEFAULT NULL COMMENT '值',
  `remark` varchar(256) DEFAULT NULL COMMENT '备注',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_time` datetime DEFAULT NULL COMMENT '修改时间',
  `create_user` varchar(30) DEFAULT NULL COMMENT '创建人',
  `update_user` varchar(30) DEFAULT NULL COMMENT '修改人',
  `yn` tinyint(4) DEFAULT NULL COMMENT '是否有效',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8 COMMENT='商品信息配置表';

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `product_dict` VALUES ('1', '10', '10', '1', 'test', '2014-12-27 17:33:05', '2014-12-27 17:33:05', '张三', '张三', '0');
INSERT INTO `product_dict` VALUES ('2', '10', '1', '原装进口', '商品类型：1，原装进口；2，进口奶源；3，国产奶粉', '2015-01-01 22:59:35', '2015-01-01 22:59:35', '张三', '张三', '1');
INSERT INTO `product_dict` VALUES ('3', '10', '2', '进口奶源', '商品类型：1，原装进口；2，进口奶源；3，国产奶粉', '2015-01-01 22:59:57', '2015-01-01 22:59:57', '张三', '张三', '1');
INSERT INTO `product_dict` VALUES ('4', '20', '0', '待审核', '商家审核状态：0，待审核；10，审核中；20，审核成功；30，审核驳回；', '2015-01-01 14:17:11', '2015-01-01 14:17:11', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('5', '20', '10', '审核中', '商家审核状态：0，待审核；10，审核中；20，审核成功；30，审核驳回；', '2015-01-01 14:17:40', '2015-01-01 14:17:40', '张三', '张三', '1');
INSERT INTO `product_dict` VALUES ('6', '20', '20', '审核成功', '商家审核状态：0，待审核；10，审核中；20，审核成功；30，审核驳回；', '2015-01-01 14:18:46', '2015-01-01 14:18:46', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('7', '20', '30', '审核驳回', '商家审核状态：0，待审核；10，审核中；20，审核成功；30，审核驳回；', '2015-01-01 14:19:03', '2015-01-01 14:19:03', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('8', '10', '3', '国产奶粉', '商品类型：1，原装进口；2，进口奶源；3，国产奶粉', '2015-01-01 23:00:31', '2015-01-01 23:00:31', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('9', '30', '10', '三方', '经营模式 ：10，三方；20，自营', '2015-01-02 16:42:48', '2015-01-02 16:42:48', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('10', '30', '20', '自营', '经营模式 ：10，三方；20，自营', '2015-01-02 16:43:12', '2015-01-02 16:43:12', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('11', '40', '10', '准备怀孕', '适用阶段 ：10，准备怀孕；20，0-3个月；30，3-6个月；40，6-12个月；50，1-2岁；', '2015-01-04 16:44:15', '2015-01-04 16:44:15', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('12', '40', '20', '0-3个月', '适用阶段 ：10，准备怀孕；20，0-3个月；30，3-6个月；40，6-12个月；50，1-2岁；', '2015-01-04 16:44:34', '2015-01-04 16:44:34', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('13', '40', '30', '3-6个月', '适用阶段 ：10，准备怀孕；20，0-3个月；30，3-6个月；40，6-12个月；50，1-2岁；', '2015-01-04 16:44:51', '2015-01-04 16:44:51', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('14', '40', '40', '6-12个月', '适用阶段 ：10，准备怀孕；20，0-3个月；30，3-6个月；40，6-12个月；50，1-2岁；', '2015-01-04 16:45:09', '2015-01-04 16:45:09', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('15', '40', '50', '1-2岁', '适用阶段 ：10，准备怀孕；20，0-3个月；30，3-6个月；40，6-12个月；50，1-2岁；', '2015-01-04 16:45:25', '2015-01-04 16:45:25', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('16', '1', '1', '是', '是否：1，是；0，否；', '2015-01-05 19:42:38', '2015-01-05 19:42:38', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('17', '1', '0', '否', '是否：1，是；0，否；', '2015-01-05 19:42:50', '2015-01-05 19:42:50', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('18', '50', '10', '桶装', '包装方式 ：10，桶装；20，罐装；30，袋装；40，无；', '2015-01-05 19:48:43', '2015-01-05 19:48:43', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('19', '50', '20', '罐装', '包装方式 ：10，桶装；20，罐装；30，袋装；40，无；', '2015-01-05 19:49:04', '2015-01-05 19:49:04', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('20', '50', '30', '袋装', '包装方式 ：10，桶装；20，罐装；30，袋装；40，无；', '2015-01-05 19:49:22', '2015-01-05 19:49:22', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('21', '50', '40', '无', '包装方式 ：10，桶装；20，罐装；30，袋装；40，无；', '2015-01-05 19:49:40', '2015-01-05 19:49:40', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('22', '60', '10', '红', '颜色 ：10，红；20，黄；30，蓝；40，绿；50，黑；60，白；', '2015-01-06 23:12:58', '2015-01-06 23:12:58', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('23', '60', '20', '黄', '颜色 ：10，红；20，黄；30，蓝；40，绿；50，黑；60，白；', '2015-01-06 23:13:10', '2015-01-06 23:13:10', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('24', '60', '30', '蓝', '颜色 ：10，红；20，黄；30，蓝；40，绿；50，黑；60，白；', '2015-01-06 23:13:27', '2015-01-06 23:13:27', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('25', '60', '40', '绿', '颜色 ：10，红；20，黄；30，蓝；40，绿；50，黑；60，白；', '2015-01-06 23:13:38', '2015-01-06 23:13:38', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('26', '60', '50', '黑', '颜色 ：10，红；20，黄；30，蓝；40，绿；50，黑；60，白；', '2015-01-06 23:13:52', '2015-01-06 23:13:52', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('27', '60', '60', '白', '颜色 ：10，红；20，黄；30，蓝；40，绿；50，黑；60，白；', '2015-01-06 23:14:04', '2015-01-06 23:14:04', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('28', '70', '0', '无', '食用方式 ：0，无；10，直接食用；20，冲配；', '2015-01-12 22:57:51', '2015-01-12 22:57:51', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('29', '70', '10', '直接食用', '食用方式 ：0，无；10，直接食用；20，冲配；', '2015-01-12 22:58:06', '2015-01-12 22:58:06', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('30', '70', '20', '冲配', '食用方式 ：0，无；10，直接食用；20，冲配；', '2015-01-12 22:58:19', '2015-01-12 22:58:19', '张三', null, '1');
INSERT INTO `product_dict` VALUES ('31', '80', '1', '是', '是否上架 ：1，是；0，否；', '2015-01-12 22:58:45', '2015-01-21 16:41:22', '张三', '张三', '1');
INSERT INTO `product_dict` VALUES ('32', '80', '0', '否', '是否上架 ：1，是；0，否；', '2015-01-12 22:58:58', '2015-01-21 16:41:14', '张三', '张三', '1');
